Repository: Victorsitou/disnake-spanish
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es

source: disnake.ext.commands API Reference
es: Referencia de API disnake.ext.commands

source: disnake.ext.tasks API Reference
es: Referencia de API disnake.ext.tasks

source: Welcome to disnake
es: Bienvenido a disnake

source: disnake is a modern, easy to use, feature-rich, and async ready API wrapper for Discord.
es: disnake es una envoltura de API para Discord moderna, fácil de usar, con muchas características y preparada para async.

source: **Features:**
es: **Características:**

source: Modern Pythonic API using ``async``\/``await`` syntax
es: API Moderna de Python que utiliza la sintaxis ``async``\/``await``.

source: Sane rate limit handling that prevents 429s
es: Gestión del límite de velocidad que evita los errores 429.

source: Command extension to aid with bot creation
es: Extensión de comandos para ayudar a la creación de bots.

source: Easy to use with an object oriented design
es: Fácil de usar con un diseño orientado a objetos.

source: Optimised for both speed and memory
es: Optimizado para la velocidad y memoria.

source: Getting started
es: Cómo empezar

source: Is this your first time using the library? This is the place to get started!
es: ¿Es ésta su primera vez usando la libreria? Este es el lugar adecuado para comenzar!

source: **First steps:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`
es: **Primeros pasos:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`.

source: **Working with Discord:** :doc:`discord` | :doc:`intents`
es: **Trabajando con Discord:** :doc:`discord` | :doc:`intents`.

source: **Examples:** Many examples are available in the :resource:`repository <examples>`.
es: **Ejemplos:** Hay muchos ejemplos disponibles en el :resource:`repositorio de GitHub<examples>`.

source: Getting help
es: Cómo obtener ayuda

source: If you're having trouble with something, these resources might help.
es: Si tiene problemas con algo, estos recursos pueden ayudarte.

source: Try the :doc:`faq` first, it's got answers to all common questions.
es: Pruebe consultar las :doc:`faq`, tiene respuestas a todas las preguntas comunes.

source: Ask us and hang out with us in our :resource:`Discord <disnake>` server.
es: Pregúntanos y pasa el rato con nosotros en nuestro :resource:`servidor de Discord <disnake>`.

source: If you're looking for something specific, try the :ref:`index <genindex>` or :ref:`searching <search>`.
es: Si busca algo en especifico, pruebe consultar el :ref:`índice <genindex>` o realizar una :ref:`búsqueda <search>`.

source: Report bugs in the :resource:`issue tracker <issues>`.
es: Reporta fallos en el :resource:`segumiento de fallos <issues>`.

source: Ask in our :resource:`GitHub discussions page <discussions>`.
es: OBSOLETO, PREGUNTAR A EQ.

source: Extensions
es: Extensiones

source: These extensions help you during development when it comes to common tasks.
es: Estas extensiones le ayudan durante el desarrollo cuando se trata de tarea comunes.

source: Manuals
es: Manuales

source: These pages go into great detail about everything the API can do.
es: Estas páginas explican con gran detalle todo lo que puede hacer la API.

source: If you're looking for something related to the project itself, it's here.
es: Si busca algo relacionado con el proyecto en sí, aquí está.
