Repository: Victorsitou/disnake-spanish
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: es

source: Introduction
es: Introducción

source: This is the documentation for disnake, a library for Python to aid in creating applications that utilise the Discord API.
es: Esta es la documentación para disnake, una librera para Python que ayuda en crear aplicaciones que utilizan la API de Discord

source: Prerequisites
es: Requisitos previos

source: disnake works with Python 3.8 or higher. Support for earlier versions of Python is not provided. Python 2.7 or lower is not supported. Python 3.7 or lower is not supported.
es: disnake funciona con Python 3.8 o superior. No hay soporte para versiones anteriores de Python. Python 2.7 o inferior no es compatible. Python 3.7 o inferior no es compatible.

source: Installing
es: Instalación

source: You can get the library directly from PyPI: ::
es: Puede obtener esta libreria directamente de PyPI: ::

source: If you are using Windows, then the following should be used instead: ::
es: Si está utilizando Windows, deberá usar lo siguente: ::

source: To get voice support, you should use ``disnake[voice]`` instead of ``disnake``, e.g. ::
es: Para obtener soporte de voz, usted debe usar ``disnake[voice]`` en cambio de ``disnake``, p. ej. ::

source: On Linux environments, installing voice requires getting the following dependencies:
es: En entornos Linux, la instalación de voz requiere tener las siguentes dependencias:

source: For a Debian-based system, the following command will get these dependencies:
es: Para sistemas basados en Debian, el siguente comando instalará las dependencias:

source: Remember to check your permissions!
es: Recuerda comprobar sus permisos!

source: Virtual Environments
es: Entornos Virtuales

source: Sometimes you want to keep libraries from polluting system installs or use a different version of libraries than the ones installed on the system. You might also not have permissions to install libraries system-wide. For this purpose, the standard library as of Python 3.3 comes with a concept called "Virtual Environment"s to help maintain these separate versions.
es: A veces quiere evitar que las librerias estén en las instalaciones del sistema o quiera utilizar una versión diferente de las librerias. También es posible que no tenga permisos para instalar las librerias en el sistema. Para este proposito, la libreria estándar a partir de Python 3.3 viene con un elemento llamado "Entorno Virtual" para ayudar a mantener estas versiones separadas.

source: A more in-depth tutorial is found on :doc:`py:tutorial/venv`.
es: Encontrará un tutorial más detallado en :doc:`py_es:tutorial/venv`.

source: However, for the quick and dirty:
es: Sin embargo, aquí hay un pequeño tutorial:

source: Go to your project's working directory:
es: Vaya al directorio de trabajo de su proyecto:

source: Activate the virtual environment:
es: Active el entorno virtual:

source: On Windows you activate it with:
es: En Windows puedes activarlo con:

source: Use pip like usual:
es: Use pip como de costumbre:

source: Congratulations. You now have a virtual environment all set up.
es: Felicitaciones. Ahora tiene un entorno virtual listo para usar.

source: Basic Concepts
es: Conceptos básicos

source: disnake revolves around the concept of :ref:`events <discord-api-events>`. An event is something you listen to and then respond to. For example, when a message happens, you will receive an event about it that you can respond to.
es: disnake funciona en torno al concepto de :ref:`eventos <discord-api-events>`. Un evento es algo que se escucha y luego se responde. Por ejemplo, cuando un mensaje es enviado, usted recibirá un evento sobre él que puede responder.

source: A quick example to showcase how events work:
es: Un ejemplo rápido para mostrar cómo funcionan los eventos:
